Enums/упТипыПрочихСоглашений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыПрочихСоглашений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоглашениеССервиснойОрганизацией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеСАЗС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеСоСтраховщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыПрочихСоглашений/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("упИспользуютсяРемонтыИТОТС") ИЛИ Не ПолучитьФункциональнуюОпцию("упИспользуетсяУчетГСМ") ИЛИ Не ПолучитьФункциональнуюОпцию("упИспользуетсяСтрахованиеГруза") Тогда 
		СтандартнаяОбработка = Ложь;
		
		СписокИсключений = Новый СписокЗначений;
		Если Не ПолучитьФункциональнуюОпцию("упИспользуютсяРемонтыИТОТС") Тогда
			СписокИсключений.Добавить(Перечисления.упТипыПрочихСоглашений.СоглашениеССервиснойОрганизацией);
		КонецЕсли;
		Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяУчетГСМ") Тогда
			СписокИсключений.Добавить(Перечисления.упТипыПрочихСоглашений.СоглашениеСАЗС);
		КонецЕсли;
		Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяСтрахованиеГруза") Тогда
			СписокИсключений.Добавить(Перечисления.упТипыПрочихСоглашений.СоглашениеСоСтраховщиком);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	упТипыПрочихСоглашений.Ссылка
		|ИЗ
		|	Перечисление.упТипыПрочихСоглашений КАК упТипыПрочихСоглашений
		|ГДЕ
		|	НЕ упТипыПрочихСоглашений.Ссылка В (&СписокИсключений)
		|
		|УПОРЯДОЧИТЬ ПО
		|	упТипыПрочихСоглашений.Порядок";
		Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
		
		ДанныеВыбора = Новый СписокЗначений;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти
